In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [100, 200, 400, 500, 600, 700]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    700
GOOG         Sam    200
MSFT     Vanessa    500

In [7]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    600
GOOG     Charlie    100
MSFT         Amy    400

In [8]:
df.groupby('Company').sum()

         Sales
Company
FB        1300
GOOG       300
MSFT       900

In [9]:
df.groupby('Company').mean()

         Sales
Company
FB         650
GOOG       150
MSFT       450

In [11]:
# This gives every other information related to the data.

df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  650.0  70.710678  600.0  625.0  650.0  675.0  700.0
GOOG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0